---
kind: other
id: Methods.T:Autodesk.Revit.DB.RuledFace
source: html/9d615585-55a7-8210-2b76-b71230c92cc4.htm
---
# RuledFace Methods

Returns the first partial derivatives of the underlying surface at the specified point.